Revit 2026 API

# PipingSystemTypeFluidTemperature Property

---

Fluid Temperature, in Kelvin.

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double FluidTemperature { get; set; }
```
```vb
Public Property FluidTemperature As Double
	Get
	Set
```
```cpp
public:
property double FluidTemperature {
	double get ();
	void set (double value);
}
```
```fsharp
member FluidTemperature : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The given value for fluidTemperature is not finite |

Setter will choose the closest available temperature in settings.

#### Reference

PipingSystemType Class

Autodesk.Revit.DB.Plumbing Namespace